Data/Section 5/5.2/Client/VM2_Instance2/rep3/output_C2_T1_W64_K6_R3.log
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  90 secs]  0 threads:       46762 ops,     500 (avg:     519) ops/sec, 1.78MB/sec (avg: 1.85MB/sec),  3.98 (avg:  3.83) msec latency

1         Threads
2         Connections per thread
90        Seconds


ALL STATS
========================================================================
Type        Ops/sec     Hits/sec   Misses/sec      Latency       KB/sec
------------------------------------------------------------------------
Sets         259.78          ---          ---      3.85700       269.78
Gets         259.78      1558.70         0.00      3.81100      1621.80
Waits          0.00          ---          ---      0.00000          ---
Totals       519.57      1558.70         0.00      3.83400      1891.57


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       1.100         0.01
SET       1.200         0.08
SET       1.300         0.34
SET       1.400         1.13
SET       1.500         2.75
SET       1.600         5.03
SET       1.700         8.52
SET       1.800        12.27
SET       1.900        16.51
SET       2.000        21.10
SET       2.100        25.31
SET       2.200        29.35
SET       2.300        32.98
SET       2.400        36.58
SET       2.500        39.61
SET       2.600        42.31
SET       2.700        44.93
SET       2.800        47.12
SET       2.900        48.88
SET       3.000        50.50
SET       3.100        52.00
SET       3.200        53.33
SET       3.300        54.68
SET       3.400        55.84
SET       3.500        57.00
SET       3.600        58.10
SET       3.700        59.20
SET       3.800        60.14
SET       3.900        61.26
SET       4.000        62.46
SET       4.100        63.53
SET       4.200        64.60
SET       4.300        65.69
SET       4.400        66.87
SET       4.500        68.06
SET       4.600        69.25
SET       4.700        70.57
SET       4.800        71.83
SET       4.900        73.20
SET       5.000        74.32
SET       5.100        75.61
SET       5.200        76.84
SET       5.300        78.08
SET       5.400        79.46
SET       5.500        80.73
SET       5.600        82.04
SET       5.700        83.27
SET       5.800        84.41
SET       5.900        85.60
SET       6.000        86.49
SET       6.100        87.24
SET       6.200        88.19
SET       6.300        88.96
SET       6.400        89.65
SET       6.500        90.20
SET       6.600        90.72
SET       6.700        91.13
SET       6.800        91.58
SET       6.900        92.04
SET       7.000        92.37
SET       7.100        92.68
SET       7.200        93.07
SET       7.300        93.39
SET       7.400        93.63
SET       7.500        93.92
SET       7.600        94.22
SET       7.700        94.51
SET       7.800        94.76
SET       7.900        95.00
SET       8.000        95.21
SET       8.100        95.39
SET       8.200        95.53
SET       8.300        95.68
SET       8.400        95.89
SET       8.500        96.07
SET       8.600        96.24
SET       8.700        96.41
SET       8.800        96.57
SET       8.900        96.73
SET       9.000        96.87
SET       9.100        97.00
SET       9.200        97.17
SET       9.300        97.32
SET       9.400        97.42
SET       9.500        97.53
SET       9.600        97.66
SET       9.700        97.76
SET       9.800        97.82
SET       9.900        97.90
SET      10.000        98.27
SET      11.000        98.75
SET      12.000        99.03
SET      13.000        99.29
SET      14.000        99.44
SET      15.000        99.56
SET      16.000        99.61
SET      17.000        99.70
SET      18.000        99.77
SET      19.000        99.82
SET      20.000        99.85
SET      21.000        99.87
SET      22.000        99.91
SET      23.000        99.93
SET      24.000        99.95
SET      25.000        99.96
SET      27.000        99.97
SET      29.000        99.97
SET      31.000        99.98
SET      38.000        99.98
SET      48.000        99.99
SET      49.000        99.99
SET      52.000       100.00
SET      61.000       100.00
---
GET       1.300         0.00
GET       1.400         0.03
GET       1.500         0.42
GET       1.600         1.35
GET       1.700         3.32
GET       1.800         6.39
GET       1.900        10.51
GET       2.000        15.24
GET       2.100        20.23
GET       2.200        25.35
GET       2.300        30.23
GET       2.400        34.48
GET       2.500        38.26
GET       2.600        41.72
GET       2.700        44.61
GET       2.800        47.36
GET       2.900        49.72
GET       3.000        51.92
GET       3.100        53.95
GET       3.200        55.77
GET       3.300        57.41
GET       3.400        58.80
GET       3.500        60.08
GET       3.600        61.25
GET       3.700        62.30
GET       3.800        63.31
GET       3.900        64.29
GET       4.000        65.22
GET       4.100        66.17
GET       4.200        67.16
GET       4.300        68.14
GET       4.400        69.27
GET       4.500        70.32
GET       4.600        71.29
GET       4.700        72.23
GET       4.800        73.29
GET       4.900        74.38
GET       5.000        75.56
GET       5.100        76.70
GET       5.200        77.90
GET       5.300        79.02
GET       5.400        80.17
GET       5.500        81.58
GET       5.600        82.83
GET       5.700        84.08
GET       5.800        85.35
GET       5.900        86.47
GET       6.000        87.52
GET       6.100        88.58
GET       6.200        89.42
GET       6.300        90.30
GET       6.400        91.01
GET       6.500        91.66
GET       6.600        92.19
GET       6.700        92.67
GET       6.800        93.20
GET       6.900        93.61
GET       7.000        93.96
GET       7.100        94.29
GET       7.200        94.55
GET       7.300        94.81
GET       7.400        95.08
GET       7.500        95.33
GET       7.600        95.54
GET       7.700        95.78
GET       7.800        95.96
GET       7.900        96.13
GET       8.000        96.32
GET       8.100        96.52
GET       8.200        96.65
GET       8.300        96.80
GET       8.400        96.93
GET       8.500        97.04
GET       8.600        97.15
GET       8.700        97.24
GET       8.800        97.38
GET       8.900        97.46
GET       9.000        97.56
GET       9.100        97.69
GET       9.200        97.78
GET       9.300        97.89
GET       9.400        97.96
GET       9.500        98.02
GET       9.600        98.11
GET       9.700        98.16
GET       9.800        98.22
GET       9.900        98.29
GET      10.000        98.59
GET      11.000        99.06
GET      12.000        99.32
GET      13.000        99.47
GET      14.000        99.54
GET      15.000        99.62
GET      16.000        99.66
GET      17.000        99.72
GET      18.000        99.76
GET      19.000        99.78
GET      20.000        99.79
GET      21.000        99.82
GET      22.000        99.85
GET      23.000        99.87
GET      25.000        99.88
GET      26.000        99.90
GET      27.000        99.91
GET      28.000        99.91
GET      30.000        99.92
GET      31.000        99.93
GET      33.000        99.93
GET      39.000        99.94
GET      43.000        99.94
GET      45.000        99.94
GET      49.000        99.95
GET      50.000        99.95
GET      51.000        99.96
GET      52.000        99.96
GET      56.000        99.97
GET      59.000        99.97
GET      60.000        99.98
GET      61.000        99.98
GET      62.000        99.99
GET      68.000        99.99
GET      82.000       100.00
GET     110.000       100.00
---